INSERT INTO authors (first_name, last_name, country, birth_year)
VALUES
    ('Лев', 'Толстой', 'Россия', 1828),
    ('Джордж', 'Оруэлл', 'Великобритания', 1903),
    ('Рэй', 'Брэдбери', 'США', 1920),
    ('Фёдор', 'Достоевский', 'Россия', 1821);

INSERT INTO categories (name, description)
VALUES
    ('Классика', 'Классическая литература'),
    ('Антиутопия', 'Произведения об антиутопических обществах'),
    ('Фантастика', 'Научная и социальная фантастика'),
    ('Роман', 'Художественные романы');

INSERT INTO customers
(first_name, last_name, email, phone, registration_date, address)
VALUES
    ('Иван', 'Иванов', 'ivan@example.com', '+79001112233', '2026-09-01', 'Казань'),
    ('Анна', 'Петрова', 'anna@example.com', '+79002223344', '2026-09-03', 'Москва'),
    ('Максим', 'Сидоров', 'max@example.com', '+79003334455', '2026-09-05', 'Казань'),
    ('Алина', 'Смирнова', 'alina@example.com', '+79004445566', '2026-09-08', 'Самара');

INSERT INTO books
(title, price, stock_quantity, description, author_id, category_id, isbn)
VALUES
    (
        'Война и мир',
        1500.00,
        10,
        'Роман Льва Толстого',
        1,
        1,
        '978-5-001'
    ),
    (
        '1984',
        900.00,
        15,
        'Антиутопический роман',
        2,
        2,
        '978-5-002'
    ),
    (
        '451 градус по Фаренгейту',
        1100.00,
        8,
        'Фантастический роман',
        3,
        3,
        '978-5-003'
    ),
    (
        'Преступление и наказание',
        1200.00,
        12,
        'Роман Фёдора Достоевского',
        4,
        1,
        '978-5-004'
    );


INSERT INTO orders
(order_date, status, total_amount, customer_id)
VALUES
    ('2026-09-10', 'Новый', 2400.00, 1),
    ('2026-09-11', 'Оплачен', 1500.00, 2),
    ('2026-09-12', 'Доставлен', 2200.00, 3),
    ('2026-09-13', 'Новый', 1200.00, 4);


INSERT INTO order_items
(order_id, book_id, quantity, price)
VALUES
    (1, 2, 1, 900.00),
    (1, 1, 1, 1500.00),
    (2, 1, 1, 1500.00),
    (3, 3, 2, 1100.00),
    (4, 4, 1, 1200.00);